[
    {
        "trend": "India won't be bullied by Trump, Doval told Rubio; govt was willing to wait out US president's term, says",
        "verdict": "Fake News",
        "rumor": "India's Ajit Doval told Marco Rubio that India would not be bullied by Trump and was willing to wait out his presidential term.",
        "reality": "There is no public record or credible report from official sources or reputable news outlets confirming that India's National Security Advisor Ajit Doval made such a statement to US Senator Marco Rubio, nor that such a conversation took place with these specific remarks.",
        "analysis": "This claim lacks any verifiable evidence in public domain. Diplomatic exchanges, especially those involving such direct and potentially confrontational language, are either officially reported or credibly leaked, neither of which has occurred in this instance. Without any supporting information from official channels or reliable media, the claim appears to be unsubstantiated and potentially fabricated.",
        "source": "No Credible Source",
        "image_url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/69bb/live/107282f0-fdb6-11ef-9dc2-07adf4375293.jpg.webp",
        "timestamp": "2026-02-05T08:34:43.937972"
    },
    {
        "trend": "Supreme Court on NEET-PG",
        "verdict": "Verified",
        "rumor": "Supreme Court has cancelled NEET-PG 2025.",
        "reality": "FALSE. The Supreme Court has only issued a notice on a plea regarding the schedule. No stay order or cancellation has been granted. The exam is proceeding as planned.",
        "analysis": "The Supreme Court has issued notice on a plea regarding the NEET-PG 2025 exam schedule. No stay order has been granted yet.",
        "source": "LiveLaw",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Supreme_Court_of_India_-_01.jpg/1200px-Supreme_Court_of_India_-_01.jpg",
        "timestamp": "2026-02-04T21:14:03.248938"
    },
    {
        "trend": "Digital Rupee Replacement",
        "verdict": "Fake News",
        "rumor": "Government will replace physical cash with Digital Rupee by March 31.",
        "reality": "This is completely baseless. The Digital Rupee (eâ‚¹) is a complementary digital currency, not a replacement for physical cash. Verify official RBI notifications.",
        "analysis": " viral message claiming that RBI will ban PhonePe, GPay, and Paytm from February 28 is FALSE.",
        "source": "RBI / PIB Fact Check",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Indian_Rupee_symbol.svg/800px-Indian_Rupee_symbol.svg.png",
        "timestamp": "2026-02-04T21:14:03.248958"
    },
    {
        "trend": "Two terrorists killed in Kashmir",
        "verdict": "Verified",
        "rumor": "Terror attack ongoing in Srinagar.",
        "reality": "Security forces successfully neutralized two terrorists in Sopore. The operation is concluded. Search operations are underway.",
        "analysis": "Security forces neutralized two terrorists in an encounter.",
        "source": "India Today",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Army_personnel_during_an_encounter.jpg/800px-Army_personnel_during_an_encounter.jpg",
        "timestamp": "2026-02-04T21:14:03.248967"
    }
]